SM_для_EDT/src/InformationRegisters/рарусЛогСменыВариантаСинхронизации/рарусЛогСменыВариантаСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусЛогСменыВариантаСинхронизации</name>
  <comment>rarus makole БСО.СМ.007.05</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Вариант</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/рарусЛогСменыВариантаСинхронизации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

// Процедура записывает событие смены варианта синхронизации в журнал
//
// Параметры:
//  Узел  - ПланОбменаСсылка.Полный - Ссылка на узел плана обмена Полный, по которому записывается
//                 событие
//  Вариант - Число - установленный номер варианта синхронизации, 
//                 где 1 - Срочное (важное), 2 - Стандартный обмен, 3 - Полная синхронизация
//  Ответственный  - СправочникСсылка.Пользователи - Пользователь, сменивший вариант синхронизации
//				   - Строка - Текст описания причины смены варианта
//  Перезаписывать - Булево - Признак необходимости перезаписи события в случае присутствия записи на 
//					заданный Период по указанному Узлу
//  Период  - Дата - Период регистрации события смены варианта
//
Процедура ЗаписатьСобытие(Узел, Вариант, Ответственный, Перезаписывать = Ложь, Период = Неопределено) Экспорт
	
	Если ТипЗнч(Узел) = Тип("Строка") Тогда
		КодУзла = Узел
	Иначе
		КодУзла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Узел, "Код")
	КонецЕсли;
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса()
	КонецЕсли;
		
	НаборЗаписей = РегистрыСведений.рарусЛогСменыВариантаСинхронизации.СоздатьНаборЗаписей(); 

	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла); 
	НаборЗаписей.Отбор.Период.Установить(Период); 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Период = Период; 
	НоваяЗапись.КодУзла = КодУзла; 
	НоваяЗапись.Вариант = Вариант; 
	НоваяЗапись.Ответственный = Ответственный; 

	НаборЗаписей.Записать(Перезаписывать); 
	
КонецПроцедуры

#КонецЕсли
